In [1]:
import re

In [2]:
string = "Python and Machine Learning 7741 is syllabus of Data Science."
result = re.findall(r"[a-zA-Z0-9]",string)
result

['P',
 'y',
 't',
 'h',
 'o',
 'n',
 'a',
 'n',
 'd',
 'M',
 'a',
 'c',
 'h',
 'i',
 'n',
 'e',
 'L',
 'e',
 'a',
 'r',
 'n',
 'i',
 'n',
 'g',
 '7',
 '7',
 '4',
 '1',
 'i',
 's',
 's',
 'y',
 'l',
 'l',
 'a',
 'b',
 'u',
 's',
 'o',
 'f',
 'D',
 'a',
 't',
 'a',
 'S',
 'c',
 'i',
 'e',
 'n',
 'c',
 'e']

In [3]:
string = "Python and Machine Learning is syllabus of data science and deep learning."
result = re.split(r"and",string)
result

['Python ',
 ' Machine Learning is syllabus of data science ',
 ' deep learning.']

In [4]:
str1='Python and Data Science Batch 2023'
result = re.findall(r"\bab*[a-z]*\b",str1)
result

['and']

In [5]:
sample_string = "There are 123 45 678 90 2345 67 12 345 6789 0123 three-digit"
result = re.findall(r"\b\d{3}\s\d{2}\b",sample_string)
result

['123 45', '678 90']

In [6]:
str1= "python and data pytthon science pythonnn pyyth annd pythh"
result = re.findall(r"p+",str1)
result

['p', 'p', 'p', 'p', 'p']

In [7]:
str1 = 'We can write INFORM in lowercase as inform'
result = re.findall(r"INFORM|inform",str1)
result

['INFORM', 'inform']

In [8]:
str1= " data science and pytthon science abbbss and pyt"
result = re.findall(r"py?",str1)
result

['py', 'py']

In [9]:
str1= "python and data pbbbtthon science pytbbbonnn and pyt"
result = re.findall(r"\b\w*[b]{3}\w*\b",str1)
result

['pbbbtthon', 'pytbbbonnn']

In [10]:
str1= "abbbs and data abbbsolutely science abbrivation and pyt"
result = re.findall(r"\b\w*[b]{2,3}\w*\b",str1)
result

['abbbs', 'abbbsolutely', 'abbrivation']

In [11]:
str1= "abbbs and data abbbsolutely or science an abbrivation and pyt"
result = re.findall(r"\b\w{3,5}\b",str1)
result

['abbbs', 'and', 'data', 'and', 'pyt']

In [12]:
str1= "abbbs and data abbbsolutely or science_ an abbrivation_ and pyt_"
result = re.findall(r"[a-z]+[_]",str1)
result

['science_', 'abbrivation_', 'pyt_']

In [14]:
str1= "Abbbs and Data Abbbsolutely or Science_ an Abbrivation_ and pyt_"
result = re.findall(r"[A-Z][a-z]+",str1)
result

['Abbbs', 'Data', 'Abbbsolutely', 'Science', 'Abbrivation']

In [15]:
str1= "data absorb Science and Abbrivation and pyt"
result = re.findall(r"\ba.+b\b",str1)
result

['absorb']

In [16]:
str1 = 'Suceess is a jurney not a desti9nation.'
result = re.findall(r"Suceess",str1)
result

['Suceess']

In [17]:
str1 = 'new begening of LIFE .'
result = re.findall(r"LIFE .",str1)
result

['LIFE .']

In [18]:
str1 = "today is the very lazy day"
result = re.findall(r"\w*z\w",str1)
result

['lazy']

In [19]:
str1 = "we have a lazy cat"
result = re.findall(r"[a-y]*z[a-y]",str1)
result

['lazy']

In [20]:
str1 = "RudrANSHI_12345_wadekar"
result = re.findall(r"\w{1,}",str1)
result

['RudrANSHI_12345_wadekar']

In [21]:
str1 = "9821 maya"
result = re.findall(r"^9",str1)
result

['9']

In [22]:
str1 = "9821 maya"
result = re.findall(r"^\d*",str1)
result

['9821']

In [23]:
ip_adress="216.008.904.196"
result = re.sub(r"\b0.","",ip_adress)
result

'216.8.904.196'

In [25]:
str1="Python is required for data science version 3.2"
result = re.findall(r"\d\b",str1)
result

['3', '2']

In [26]:
str1 = "Exercises number 1, 12, 13, and 345 are important"
result = re.findall(r"\d+",str1)
result

['1', '12', '13', '345']

In [27]:
Sample_text ='The quick brown fox jumps over the lazy dog.'
Searched_words ='fox', 'dog', 'horse'
for word in Searched_words:
    result = re.findall(word,Sample_text)
    print(result)

['fox']
['dog']
[]

In [28]:
sample_text ='The quick brown fox jumps over the lazy dog.'
result = re.search("fox",sample_text)
result

In [29]:
Sample_text = 'Python exercises, PHP exercises, C# exercises'
result = re.findall(r"exercises",Sample_text)
result

['exercises', 'exercises', 'exercises']

In [30]:
Sample_text = 'Python exercises, PHP exercises, C# exercises'
result = re.findall(r"exercises",Sample_text)
print(len(result))
result = re.search("exercises",Sample_text)
print(result)

3
<re.Match object; span=(7, 16), match='exercises'>

In [31]:
str1 = 'The quick brown fox jumps over the lazy dog.'
result = re.sub(r"[ ]","_",str1)
print(result)
result = re.sub(r"[_]"," ",str1)
result

The_quick_brown_fox_jumps_over_the_lazy_dog.

'The quick brown fox jumps over the lazy dog.'

In [32]:
str1 = 'The quick brown fox jumps over the lazy dog.'
result = re.sub(r"[ ]","",str1)
result

'Thequickbrownfoxjumpsoverthelazydog.'

In [33]:
str1= "python and data science pythonnn"
result = re.findall(r"[p]\w*",str1)
result

['python', 'pythonnn']

In [34]:
str1= "data science and python learning with begening every evening "
result = re.findall(r"\b[a,e]\w*",str1)
result

['and', 'every', 'evening']

In [35]:
str1 = "i am mrunal chaudhari ,my age is 24"
result = re.search(r"\d",str1)
result

In [37]:
text ="""Python. is a general,purpose, interpreted."""
result = re.sub(r"[., ]",":",text)
result

'Python::is:a:general:purpose::interpreted:'

In [38]:
text ="""Python., is a general purpose interpreted."""
result = re.sub(r"[., ]{2}",":",text)
result

'Python: is a general purpose interpreted.'

In [39]:
text ="""123 Python is a general-purpose, interpreted,
high-level programming language popularly used for
website development, data analytics 78 and automation."""

result = re.findall(r"\b\D{3,5}\b",text)
result

[' is a', 'high-', 'level', ' used', ' for\n', 'data ', ' and ']

In [40]:
text1 = '"Python", "Data", "Science"'
result = re.findall('""(.+?)""',text1)
result

[]

1. Employees (ID, Name)
2. Salaries (ID, EmployeeID, Salary)
Givequery to find third highest salary

In [ ]:
df1 >> Employess(Id,Name)
df2 >> Salaries(ID,EmployeeID, Salary)

In [1]:
import numpy as np

In [2]:
arr1 = np.zeros(10)
arr1

array([0., 0., 0., 0., 0., 0., 0., 0., 0., 0.])

In [3]:
arr1.nbytes

80

In [4]:
arr1 = np.zeros(10)
print(arr1)
arr1[4] = 1
print(arr1)

[0. 0. 0. 0. 0. 0. 0. 0. 0. 0.]
[0. 0. 0. 0. 1. 0. 0. 0. 0. 0.]

In [5]:
arr1 = np.arange(15,46)
arr1

array([15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31,
       32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45])

In [6]:
arr1[::-1]

array([45, 44, 43, 42, 41, 40, 39, 38, 37, 36, 35, 34, 33, 32, 31, 30, 29,
       28, 27, 26, 25, 24, 23, 22, 21, 20, 19, 18, 17, 16, 15])

In [8]:
arr2 = reversed(arr1)
list(arr2)

[45,
 44,
 43,
 42,
 41,
 40,
 39,
 38,
 37,
 36,
 35,
 34,
 33,
 32,
 31,
 30,
 29,
 28,
 27,
 26,
 25,
 24,
 23,
 22,
 21,
 20,
 19,
 18,
 17,
 16,
 15]

In [9]:
arr1 = np.random.randint(1,10,size=(2,2))
print("Array 1:\n",arr1)
arr2 = np.random.randint(10,20,size=(2,2))
print("Array 2:\n",arr2)

Array 1:
 [[6 9]
 [4 8]]
Array 2:
 [[12 10]
 [15 10]]

In [10]:
add1 = arr1 + arr2
add1

array([[18, 19],
       [19, 18]])

In [11]:
sub1 = arr1 - arr2
sub1

array([[ -6,  -1],
       [-11,  -2]])

In [12]:
arr1 = np.array([1.3,1.8,2.3,3.9,1,4,1.9,9,.3])
arr1.round()

array([1., 2., 2., 4., 1., 4., 2., 9., 0.])

In [13]:
np.floor(arr1)

array([1., 1., 2., 3., 1., 4., 1., 9., 0.])

In [14]:
np.ceil(arr1)

array([2., 2., 3., 4., 1., 4., 2., 9., 1.])

In [15]:
arr1 = np.array([[1,2,3],[4,5,6],[7,8,9]])
print("Array 1:\n",arr1)
mean_row = np.mean(arr1,axis=1)
print("mean_row:\n",mean_row)
mean_col = np.mean(arr1,axis=0)
print("mean_col:\n",mean_col)

Array 1:
 [[1 2 3]
 [4 5 6]
 [7 8 9]]
mean_row:
 [2. 5. 8.]
mean_col:
 [4. 5. 6.]

In [16]:
list1 = [0,30,45,60,90]
result = np.deg2rad(list1)
result

array([0.        , 0.52359878, 0.78539816, 1.04719755, 1.57079633])

In [18]:
arr1 = np.arange(9).reshape(3,3)
print("Array:\n",arr1)

Array:
 [[0 1 2]
 [3 4 5]
 [6 7 8]]

In [19]:
arr1 = np.array([[1,2,3],[4,5,6],[7,8,9]])
print("Array:\n",arr1)
arr1[:: , ::-1]

Array:
 [[1 2 3]
 [4 5 6]
 [7 8 9]]

array([[3, 2, 1],
       [6, 5, 4],
       [9, 8, 7]])

In [20]:
arr1

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [21]:
arr1[::-1]

array([[7, 8, 9],
       [4, 5, 6],
       [1, 2, 3]])

In [22]:
result = np.nonzero([1,2,0,0,4,0])
result

(array([0, 1, 4], dtype=int64),)

In [23]:
arr1 = np.array([[1,2],[3,4]])
print("Array:\n",arr1)
result = np.linalg.det(arr1)
result

Array:
 [[1 2]
 [3 4]]

-2.0000000000000004

In [24]:
arr1 = np.array([[2,3],[3,9]])
print("Array:\n",arr1)
result = np.linalg.inv(arr1)
result

Array:
 [[2 3]
 [3 9]]

array([[ 1.        , -0.33333333],
       [-0.33333333,  0.22222222]])

In [25]:
arr1 = np.random.randint(1,10,size=(30))
print("Array:\n",arr1)
result = np.mean(arr1)
result

Array:
 [4 8 7 5 8 4 2 7 6 6 2 5 3 4 9 9 3 3 7 5 6 1 5 7 6 3 6 8 2 2]

5.1

In [27]:
arr1 = np.array([1,2,3,4,5,6,7,8,9,10])
print("Array:\n",arr1)
result = np.where(arr1 > 5)
result

Array:
 [ 1  2  3  4  5  6  7  8  9 10]

(array([5, 6, 7, 8, 9], dtype=int64),)

In [28]:
arr1 = np.random.random((3,3,3))
print("Array:\n",arr1)

Array:
 [[[0.57307661 0.89460307 0.68308705]
  [0.89876096 0.73287018 0.12487674]
  [0.81891687 0.10239401 0.90846163]]

 [[0.84543455 0.38803618 0.62816404]
  [0.65488595 0.37033795 0.09129177]
  [0.00157917 0.01403287 0.95541213]]

 [[0.44203435 0.54786398 0.72276343]
  [0.96043252 0.34233747 0.94501412]
  [0.21621936 0.1465995  0.07905874]]]

In [29]:
arr1 = np.random.rand(10,10)
print("Array:\n",arr1)
result = np.max(arr1)
result

Array:
 [[0.36481707 0.67856368 0.95176247 0.38238907 0.89619541 0.59662026
  0.59685643 0.59061008 0.77584196 0.83150866]
 [0.71313898 0.07927792 0.89280827 0.38696606 0.2152263  0.67964407
  0.06645161 0.07256513 0.55569085 0.50544835]
 [0.79482048 0.97530213 0.9178706  0.00177172 0.98587065 0.57140925
  0.84367859 0.13015604 0.71996918 0.38085302]
 [0.6843209  0.22317914 0.56271179 0.9673463  0.61754263 0.78857177
  0.01788446 0.61876513 0.59233923 0.97072072]
 [0.4077482  0.53199988 0.18380807 0.39031726 0.88785415 0.32226221
  0.53583555 0.78168897 0.10287611 0.83703317]
 [0.1786474  0.9544824  0.35813901 0.11912051 0.85096942 0.33423536
  0.66440222 0.70340755 0.088419   0.9949557 ]
 [0.87521346 0.2003247  0.12754188 0.7795376  0.45674043 0.91463597
  0.57805643 0.6949259  0.1848071  0.79019032]
 [0.37926215 0.02939574 0.60317873 0.75323803 0.16169931 0.42030303
  0.28784286 0.14598463 0.13056894 0.54515163]
 [0.61154361 0.65321047 0.85260887 0.46179547 0.89152848 0.21568588
  0.70945617 0.8452451  0.60327148 0.49570326]
 [0.55955534 0.84346042 0.2590427  0.79039721 0.73991472 0.00738896
  0.43843853 0.03526054 0.16544028 0.29518583]]

0.9949557020742884

In [30]:
result = np.min(arr1)
result

0.0017717196606302776

In [31]:
arr1 = np.ones((10,10))
arr1[1:-1,1:-1] = 0
print("Array:\n",arr1)

Array:
 [[1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]
 [1. 0. 0. 0. 0. 0. 0. 0. 0. 1.]
 [1. 0. 0. 0. 0. 0. 0. 0. 0. 1.]
 [1. 0. 0. 0. 0. 0. 0. 0. 0. 1.]
 [1. 0. 0. 0. 0. 0. 0. 0. 0. 1.]
 [1. 0. 0. 0. 0. 0. 0. 0. 0. 1.]
 [1. 0. 0. 0. 0. 0. 0. 0. 0. 1.]
 [1. 0. 0. 0. 0. 0. 0. 0. 0. 1.]
 [1. 0. 0. 0. 0. 0. 0. 0. 0. 1.]
 [1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]]

In [32]:
arr1 = np.zeros((5,5),dtype=int)
np.fill_diagonal(arr1[1:],[1,2,3,4])
print("Array:\n",arr1)

Array:
 [[0 0 0 0 0]
 [1 0 0 0 0]
 [0 2 0 0 0]
 [0 0 3 0 0]
 [0 0 0 4 0]]

In [33]:
arr1 = np.eye(3,3)
print("Array:\n",arr1)

Array:
 [[1. 0. 0.]
 [0. 1. 0.]
 [0. 0. 1.]]

In [34]:
arr1 = np.random.randint(1,10,size=(5,3))
arr2 = np.random.randint(1,10,size=(3,2))
result = np.dot(arr1, arr2)
result

array([[48, 32],
       [74, 63],
       [67, 48],
       [74, 65],
       [35, 26]])

In [35]:
arr1 = np.array([1,2,3,4,5,6,7,8,44,9,33,6,5,10])
result = np.where((arr1 >= 3) & (arr1 <= 8), -1*arr1,arr1)
result

array([ 1,  2, -3, -4, -5, -6, -7, -8, 44,  9, 33, -6, -5, 10])

In [36]:
arr1 = np.array([[1.215413,2.654139],[3.4513056,5.2141555]])
result = np.round(arr1,1)
result

array([[1.2, 2.7],
       [3.5, 5.2]])

In [37]:
np.ceil(arr1)

array([[2., 3.],
       [4., 6.]])

In [38]:
np.floor(arr1)

array([[1., 2.],
       [3., 5.]])

In [39]:
arr1 = np.array([1,2,3,4,5,6])
arr2 = np.array([4,5,6,7,8,9])
result = np.intersect1d(arr1, arr2)
result

array([4, 5, 6])

In [40]:
arr1 = np.linspace(0,1,10)[1:-1]
arr1

array([0.11111111, 0.22222222, 0.33333333, 0.44444444, 0.55555556,
       0.66666667, 0.77777778, 0.88888889])

In [41]:
arr1 = np.random.randint(1,10,size=(10))
print(arr1)
result = np.sort(arr1)
result

[4 9 6 6 8 1 4 4 6 9]

array([1, 4, 4, 4, 6, 6, 6, 8, 9, 9])

In [42]:
arr1 = np.zeros((5,5))
print("Array :\n",arr1)
arr2 = arr1 + np.arange(5)
print("Array :\n",arr2)

Array :
 [[0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0.]]
Array :
 [[0. 1. 2. 3. 4.]
 [0. 1. 2. 3. 4.]
 [0. 1. 2. 3. 4.]
 [0. 1. 2. 3. 4.]
 [0. 1. 2. 3. 4.]]

In [43]:
arr1 = np.random.randint(1,10,size=(5))
arr2 = np.random.randint(1,10,size=(5))
if np.equal == True:
    print("Both arrays are equal")
else:
    print("Both arrays are not equal")

Both arrays are not equal

In [44]:
np.allclose(arr1, arr2)

False

In [45]:
arr1 = np.random.randint(1,10,size=(10))
print("Array:\n",arr1)
result = np.where((arr1 == np.max(arr1)) , 0 , arr1)
result

Array:
 [7 1 4 7 3 4 7 7 9 3]

array([7, 1, 4, 7, 3, 4, 7, 7, 0, 3])

In [47]:
arr1 = np.array([[[1,2,3],[4,5,6],[7,8,9]]])
print("Array:\n",arr1)
for i in np.nditer(arr1):
    print(i,end=" ")

Array:
 [[[1 2 3]
  [4 5 6]
  [7 8 9]]]
1 2 3 4 5 6 7 8 9

In [48]:
arr1 = np.array([[[1,2,3],[4,5,6],[7,8,9]]])
for index,value in np.ndenumerate(arr1):
    print(f"{index} index has {value} value")

(0, 0, 0) index has 1 value
(0, 0, 1) index has 2 value
(0, 0, 2) index has 3 value
(0, 1, 0) index has 4 value
(0, 1, 1) index has 5 value
(0, 1, 2) index has 6 value
(0, 2, 0) index has 7 value
(0, 2, 1) index has 8 value
(0, 2, 2) index has 9 value

In [49]:
arr1 = np.random.randint(1,10,size=(3,3))
print("Array:\n",arr1)
result = (arr1[arr1[:,2].argsort()])
result

Array:
 [[4 2 2]
 [3 2 6]
 [8 4 9]]

array([[4, 2, 2],
       [3, 2, 6],
       [8, 4, 9]])

In [50]:
arr1 = np.array([[4,3,1],[5,8,9],[3,4,5]])
print("Array:\n",arr1)
arr1[[0,2]] = arr1[[2,0]]
arr1

Array:
 [[4 3 1]
 [5 8 9]
 [3 4 5]]

array([[3, 4, 5],
       [5, 8, 9],
       [4, 3, 1]])

In [51]:
arr1 = np.array([1,2,3,4,5,6,7,8,9,10])
result = np.mean(arr1)
result

5.5

In [52]:
np.median(arr1)

5.5

In [53]:
arr1 = np.random.randint(1,10,size=(10))
print(arr1)
result = np.std(arr1)
result

[9 9 9 4 7 4 1 4 3 2]

2.891366458960192

In [54]:
from scipy.stats import mode
arr1 = np.array([1,2,3,4,5,6,7,8,9,10])
result = mode(arr1)
result

ModeResult(mode=1, count=1)

In [55]:
result = np.round(5.98697,2)
result

5.99

In [56]:
arr1 = np.array([[2,3],[3,4]])
print("Array:\n",arr1)
result = np.linalg.inv(arr1)
result

Array:
 [[2 3]
 [3 4]]

array([[-4.,  3.],
       [ 3., -2.]])

In [57]:
x = np.array([1,2,3])
y = np.array([4,5,6])
result = np.cov(x,y)
result

array([[1., 1.],
       [1., 1.]])

In [58]:
arr1 = np.array([1,1,2,2,3,4,5,6,7,8,9,6,4,3,6,7])
result = mode(arr1)
result

ModeResult(mode=6, count=3)

In [59]:
arr1 = np.array([1,2,3,4,5,6,7,8,9,10])
print(arr1)
arr1.shape
arr2 = np.reshape(arr1,(2,5,1))
print(arr2)

[ 1  2  3  4  5  6  7  8  9 10]
[[[ 1]
  [ 2]
  [ 3]
  [ 4]
  [ 5]]

 [[ 6]
  [ 7]
  [ 8]
  [ 9]
  [10]]]

In [60]:
arr1 = np.random.randint(1,10,size=(1,2,3,4))
print("Array:\n",arr1)
arr2 = np.reshape(arr1,(6,4))
arr2

Array:
 [[[[5 7 2 4]
   [6 5 6 4]
   [8 8 8 9]]

  [[6 7 7 3]
   [8 5 2 3]
   [2 2 1 2]]]]

array([[5, 7, 2, 4],
       [6, 5, 6, 4],
       [8, 8, 8, 9],
       [6, 7, 7, 3],
       [8, 5, 2, 3],
       [2, 2, 1, 2]])

In [61]:
arr1 = np.zeros(10,dtype=int)
arr1

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0])

In [63]:
arr1 = np.array([[1,2,3,4],[5,6,8,7],[3,4,5,6]])
print(arr1)
arr1.shape

[[1 2 3 4]
 [5 6 8 7]
 [3 4 5 6]]

(3, 4)

In [1]:
import numpy as np
import pandas as pd

In [2]:
s1 = pd.Series([1,2,3,4,5])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
list1 = [[1,2,3],[4,5,6]]
pd.DataFrame(list1)

   0  1  2
0  1  2  3
1  4  5  6

In [4]:
df = pd.DataFrame(columns=list("ABC"),index=list("PQR"))
df

     A    B    C
P  NaN  NaN  NaN
Q  NaN  NaN  NaN
R  NaN  NaN  NaN

In [5]:
df = pd.DataFrame(columns=list("ABC"),index=list("PQR"))
if df.isnull:
    print("Dataframe is empty")
else:
    print("Dataframe is not null")

Dataframe is empty

In [6]:
arr1 = np.array([[1,2,3],[4,5,6]])
df = pd.DataFrame(arr1)
df

   0  1  2
0  1  2  3
1  4  5  6

In [7]:
list1 = [[1,2,3],[4,5,6]]
df = pd.DataFrame(list1)
df

   0  1  2
0  1  2  3
1  4  5  6

In [8]:
tuple1 = (1,2,3,4,5,6)
df = pd.DataFrame(tuple1)
df

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [9]:
dict1 = {"name" : ["hindvi","ovi","rudu"] , "marks" : [80,70,90]}
df = pd.DataFrame(dict1)
df

     name  marks
0  hindvi     80
1     ovi     70
2    rudu     90

In [10]:
l1 = [[1,2,3],[4,5,6],[7,8,9]]
df = pd.DataFrame(l1,columns=list("ABC"))
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [11]:
df = pd.DataFrame(np.random.randint(1,10,size=(5,6)))
df

   0  1  2  3  4  5
0  3  5  8  7  7  1
1  9  1  8  2  1  7
2  3  9  6  8  6  2
3  5  1  9  7  4  1
4  3  9  4  4  2  4

In [12]:
arr1 = np.array([[1,2,3],[4,5,6],[7,8,9]])
df = pd.DataFrame(arr1)
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [13]:
dict1 = {"name" : ["hindvi","ovi","rudu"] , "marks" : [80,70,90]}
df = pd.DataFrame(dict1)
df

     name  marks
0  hindvi     80
1     ovi     70
2    rudu     90

In [14]:
s1 = pd.Series([1,2,3,4,5])
print(s1)
s2 = s1.copy()
s2[0] = 50
print("Original Series :\n",s1)
print("Copied Series :\n",s2)

0    1
1    2
2    3
3    4
4    5
dtype: int64
Original Series :
 0    1
1    2
2    3
3    4
4    5
dtype: int64
Copied Series :
 0    50
1     2
2     3
3     4
4     5
dtype: int64

In [15]:
df = pd.DataFrame(np.full((4,5),6))
df

   0  1  2  3  4
0  6  6  6  6  6
1  6  6  6  6  6
2  6  6  6  6  6
3  6  6  6  6  6

In [16]:
df["5"] = [1,2,3,4]
df

   0  1  2  3  4  5
0  6  6  6  6  6  1
1  6  6  6  6  6  2
2  6  6  6  6  6  3
3  6  6  6  6  6  4

In [17]:
df.loc[4] = [1,2,3,4,5,6]
df

   0  1  2  3  4  5
0  6  6  6  6  6  1
1  6  6  6  6  6  2
2  6  6  6  6  6  3
3  6  6  6  6  6  4
4  1  2  3  4  5  6

In [18]:
arr1 = np.array([[1,2,3],[4,5,6],[7,8,9]])
df = pd.DataFrame(arr1,index=list("ABC"))
df

   0  1  2
A  1  2  3
B  4  5  6
C  7  8  9

In [19]:
arr1 = np.random.randint(1,10,size=(4,4))
df = pd.DataFrame(arr1,columns=list("ABCD"),index=list("PQRS"))
print(df)
df.rename({"A":"a","B":"b","C":"c","D":"d"},axis=1,inplace=True)
df.rename({"P":"p","Q":"q","R":"r","S":"s"},axis=1,inplace=True)
print(df)

   A  B  C  D
P  7  4  4  8
Q  7  3  3  7
R  9  9  4  9
S  4  9  1  5
   a  b  c  d
P  7  4  4  8
Q  7  3  3  7
R  9  9  4  9
S  4  9  1  5

In [20]:
for i in df.items():
    print(i)

('a', P    7
Q    7
R    9
S    4
Name: a, dtype: int32)
('b', P    4
Q    3
R    9
S    9
Name: b, dtype: int32)
('c', P    4
Q    3
R    4
S    1
Name: c, dtype: int32)
('d', P    8
Q    7
R    9
S    5
Name: d, dtype: int32)

In [21]:
for i in df.iterrows():
    print(i)

('P', a    7
b    4
c    4
d    8
Name: P, dtype: int32)
('Q', a    7
b    3
c    3
d    7
Name: Q, dtype: int32)
('R', a    9
b    9
c    4
d    9
Name: R, dtype: int32)
('S', a    4
b    9
c    1
d    5
Name: S, dtype: int32)

In [22]:
df = pd.DataFrame(np.random.randint(1,10,size=(4,4)))
print(df)
arr1 = df.values
arr1

   0  1  2  3
0  2  6  4  1
1  7  5  2  5
2  6  9  8  3
3  3  4  9  6

array([[2, 6, 4, 1],
       [7, 5, 2, 5],
       [6, 9, 8, 3],
       [3, 4, 9, 6]])

In [23]:
arr1.tolist()

[[2, 6, 4, 1], [7, 5, 2, 5], [6, 9, 8, 3], [3, 4, 9, 6]]

In [24]:
df

   0  1  2  3
0  2  6  4  1
1  7  5  2  5
2  6  9  8  3
3  3  4  9  6

In [25]:
df.reset_index(drop=True)

   0  1  2  3
0  2  6  4  1
1  7  5  2  5
2  6  9  8  3
3  3  4  9  6

In [26]:
df = pd.DataFrame(np.random.randint(1,10,size=(4,5)))
print(df)
print(df.shape[0])

   0  1  2  3  4
0  1  7  7  8  6
1  9  2  4  5  8
2  6  6  7  4  2
3  9  9  6  7  2
4

In [27]:
df.shape[1]

5

In [28]:
s1 = pd.Series(np.arange(50,60))
s2 = pd.Series(np.arange(25,35))
print(s1+s2)
print(s1-s2)
print(s1*s2)
print(s1/s2)

0    75
1    77
2    79
3    81
4    83
5    85
6    87
7    89
8    91
9    93
dtype: int32
0    25
1    25
2    25
3    25
4    25
5    25
6    25
7    25
8    25
9    25
dtype: int32
0    1250
1    1326
2    1404
3    1484
4    1566
5    1650
6    1736
7    1824
8    1914
9    2006
dtype: int32
0    2.000000
1    1.961538
2    1.925926
3    1.892857
4    1.862069
5    1.833333
6    1.806452
7    1.781250
8    1.757576
9    1.735294
dtype: float64

In [29]:
df = pd.read_excel("Sample1.xlsx")
df

,Unnamed: 0,First Name,Last Name,Gender,Country,Age,Date,Id
0,1,Dulce,Abril,Female,United States,32,15/10/2017,1562
1,2,Mara,Hashimoto,Female,Great Britain,25,16/08/2016,1582
2,3,Philip,Gent,Male,France,36,21/05/2015,2587
3,4,Kathleen,Hanner,Female,United States,25,15/10/2017,3549
4,5,Nereida,Magwood,Female,United States,58,16/08/2016,2468
...,...,...,...,...,...,...,...,...
995,996,Roma,Lafollette,Female,United States,34,15/10/2017,2654
996,997,Felisa,Cail,Female,United States,28,16/08/2016,6525
997,998,Demetria,Abbey,Female,United States,32,21/05/2015,3265
998,999,Jeromy,Danz,Male,United States,39,15/10/2017,3265
999,1000,Rasheeda,Alkire,Female,United States,29,16/08/2016,6125

In [30]:
df.columns

Index(['Unnamed: 0', 'First Name', 'Last Name', 'Gender', 'Country', 'Age',
       'Date', 'Id'],
      dtype='object')

In [31]:
df[['First Name', 'Last Name']]

    First Name   Last Name
0        Dulce       Abril
1         Mara   Hashimoto
2       Philip        Gent
3     Kathleen      Hanner
4      Nereida     Magwood
..         ...         ...
995       Roma  Lafollette
996     Felisa        Cail
997   Demetria       Abbey
998     Jeromy        Danz
999   Rasheeda      Alkire

[1000 rows x 2 columns]

In [32]:
df["Age"].mean()

33.26

In [33]:
df["Age"].max()

58

In [34]:
df["Age"].min()

21

In [35]:
df = pd.read_csv("titanic.csv")
df.head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S

In [36]:
df.groupby(df["Embarked"]).get_group("S")

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,NaN,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,NaN,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
...,...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [37]:
arr1 = np.random.randint(1,10,size=(4,2))
df = pd.DataFrame(arr1)
print(df)
df.apply(np.sqrt)

   0  1
0  1  2
1  9  6
2  2  4
3  7  7

          0         1
0  1.000000  1.414214
1  3.000000  2.449490
2  1.414214  2.000000
3  2.645751  2.645751

In [38]:
df.apply(lambda x : x**2)

    0   1
0   1   4
1  81  36
2   4  16
3  49  49

In [39]:
df.apply(lambda x : x**3)

     0    1
0    1    8
1  729  216
2    8   64
3  343  343

In [40]:
df = pd.read_csv("diabetes.csv")
df.head(3)

,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,148,50,35,0,33.6,0.627,50,1
1,85,66,29,0,26.6,0.351,31,0
2,183,64,0,0,23.3,0.672,52,1

In [41]:
df.describe()

,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
count,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000
mean,121.117188,69.076823,20.536458,79.799479,31.992578,0.471876,33.243490,0.348958
std,31.805091,19.367794,15.952218,115.244002,7.884160,0.331329,11.758182,0.476951
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.078000,21.000000,0.000000
25%,99.000000,62.000000,0.000000,0.000000,27.300000,0.243750,24.000000,0.000000
50%,117.000000,72.000000,23.000000,30.500000,32.000000,0.372500,29.000000,0.000000
75%,142.000000,80.000000,32.000000,127.250000,36.600000,0.626250,41.000000,1.000000
max,199.000000,122.000000,99.000000,846.000000,67.100000,2.420000,81.000000,1.000000

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 768 entries, 0 to 767
Data columns (total 8 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Glucose                   768 non-null    int64
 1   BloodPressure             768 non-null    int64
 2   SkinThickness             768 non-null    int64
 3   Insulin                   768 non-null    int64
 4   BMI                       768 non-null    float64
 5   DiabetesPedigreeFunction  768 non-null    float64
 6   Age                       768 non-null    int64
 7   Outcome                   768 non-null    int64
dtypes: float64(2), int64(6)
memory usage: 48.1 KB

In [43]:
df.head(3)

,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,148,50,35,0,33.6,0.627,50,1
1,85,66,29,0,26.6,0.351,31,0
2,183,64,0,0,23.3,0.672,52,1

In [44]:
df.tail(3)

,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
765,121,72,23,112,26.2,0.245,30,0
766,126,60,0,0,30.1,0.349,47,1
767,93,70,31,0,30.4,0.315,23,0

In [45]:
data1 = {"NAME" : ["Rudranshi","Sanvi","Swati","Shiva"]}
df = pd.DataFrame(data1)
df["NAME"].apply(lambda x : x.istitle())

0    True
1    True
2    True
3    True
Name: NAME, dtype: bool

In [46]:
d1 = {"Employee":["Saniya","Sara","Alexa","Jenny"]}
df = pd.DataFrame(d1)
d2 = {"Saniya": "Software Developer" , "Sara":"Developer" , "Alexa":"Assistant"}
df["desination"] = df["Employee"].map(d2)
df

  Employee          desination
0   Saniya  Software Developer
1     Sara           Developer
2    Alexa           Assistant
3    Jenny                 NaN

In [47]:
arr1 = np.random.randint(1,10,size=(5,5))
df = pd.DataFrame(arr1,columns=list("ABCDE"))
df

   A  B  C  D  E
0  8  8  7  8  4
1  4  4  9  3  4
2  5  9  7  1  2
3  7  2  4  1  8
4  8  9  6  5  3

In [48]:
df["I"] = [1,2,3,4,5]
df

   A  B  C  D  E  I
0  8  8  7  8  4  1
1  4  4  9  3  4  2
2  5  9  7  1  2  3
3  7  2  4  1  8  4
4  8  9  6  5  3  5

In [49]:
df.insert(1,"H",[1,2,1,2,1])
df

   A  H  B  C  D  E  I
0  8  1  8  7  8  4  1
1  4  2  4  9  3  4  2
2  5  1  9  7  1  2  3
3  7  2  2  4  1  8  4
4  8  1  9  6  5  3  5

In [50]:
df.drop("A",axis=1,inplace=True)
df

   H  B  C  D  E  I
0  1  8  7  8  4  1
1  2  4  9  3  4  2
2  1  9  7  1  2  3
3  2  2  4  1  8  4
4  1  9  6  5  3  5

In [51]:
df.drop(2,axis=0,inplace=True)
df

   H  B  C  D  E  I
0  1  8  7  8  4  1
1  2  4  9  3  4  2
3  2  2  4  1  8  4
4  1  9  6  5  3  5

In [52]:
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([4,5,6,7,8])
s11 = set(s1)
s22 = set(s2)
result = s11.symmetric_difference(s22)
result

{1, 2, 3, 6, 7, 8}

In [53]:
s1 = pd.Series([1,2,3,4,5])
print("Median:",s1.median())
print("Minimum:",s1.min())
print("Maximum",s1.max())
print("25th percentile:",s1.quantile(0.25))
print("75th percentile:",s1.quantile(0.75))

Median: 3.0
Minimum: 1
Maximum 5
25th percentile: 2.0
75th percentile: 4.0

In [54]:
df = pd.DataFrame(np.random.randint(10,50,size=(4,4)) , columns=list("CABD") , index=list("xzvs"))
df

    C   A   B   D
x  49  17  24  44
z  36  10  30  10
v  29  43  23  43
s  46  47  21  46

In [55]:
df.sort_index()

    C   A   B   D
s  46  47  21  46
v  29  43  23  43
x  49  17  24  44
z  36  10  30  10

In [56]:
df.sort_index(axis=1)

    A   B   C   D
x  17  24  49  44
z  10  30  36  10
v  43  23  29  43
s  47  21  46  46

In [57]:
df.sort_values("D")

    C   A   B   D
z  36  10  30  10
v  29  43  23  43
x  49  17  24  44
s  46  47  21  46

In [58]:
df = pd.DataFrame({"A" : [1,1,3,4,5],
                   "B" : [1,1,3,4,5],
                   "C" : [1,1,3,4,5],
                   "D" : [1,1,3,4,5]})
df

   A  B  C  D
0  1  1  1  1
1  1  1  1  1
2  3  3  3  3
3  4  4  4  4
4  5  5  5  5

In [59]:
df.drop_duplicates()

   A  B  C  D
0  1  1  1  1
2  3  3  3  3
3  4  4  4  4
4  5  5  5  5

In [60]:
data = {'Full Name': ['John Doe', 'Jane Smith', 'Bob Johnson']}
df = pd.DataFrame(data)
df[["First Name","Last Name"]] = df["Full Name"].str.split(expand=True)
df

     Full Name First Name Last Name
0     John Doe       John       Doe
1   Jane Smith       Jane     Smith
2  Bob Johnson        Bob   Johnson